lvx/base/Catalogs/бит_ВидыСоответствийАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ВидыСоответствийАналитик</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Соотношение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыСоотношенийАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_1</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_2</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_3</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_1</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_2</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_3</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименятьПриПолномСовпаденииТипов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АнализироватьКорреспондирующийСчет</Name>
					<Comment>Анализировать корреспондирующий счет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/InformationRegisters/бит_СоответствияАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СоответствияАналитик</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСоответствия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыСоответствийАналитик</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛеваяАналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛеваяАналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛеваяАналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваяАналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваяАналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваяАналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Enums/бит_ВидыСоотношенийАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыСоотношенийАналитик</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОдинКОдному</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинКоМногим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногиеКОдному</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногиеКоМногим</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Catalogs/бит_ВидыСоответствийАналитик/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область НачальноеЗаполнениеДанных

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника бит_КомандыБотуТелеграм.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	// ++ ЕРП 
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных 		   = "Организации_ЦФО";
	Элемент.Наименование					   = НСтр("ru = 'Организации --> ЦФО'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код								   = "Организации_ЦФО";
	Элемент.Соотношение						   = Перечисления.бит_ВидыСоотношенийАналитик.ОдинКОдному;
	Элемент.Приоритет						   = 0;
	Элемент.ЛеваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Организации;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ЦФО;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных 		   = "СтатьиДДС_СтатьиОборотов";
	Элемент.Наименование 					   = НСтр("ru = 'Статьи ДДС --> Cтатьи оборотов'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код 							   = "СтатьиДДС_СтатьиОборотов";
	// АПК:1297-вкл.
	Элемент.Соотношение 					   = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКОдному;
	Элемент.Приоритет 						   = 0;
	Элемент.ЛеваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьиДвиженияДенежныхСредств;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных		   = "СтатьиДоходов_СтатьиОборотов";
	Элемент.Наименование					   = НСтр("ru = 'Статьи прочих доходов --> Статьи оборотов'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код 							   = "СтатьиПрочихДоходов_СтатьиОборотов";
	// АПК:1297-вкл.
	Элемент.Соотношение						   = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКОдному;
	Элемент.Приоритет 						   = 0;
	Элемент.ЛеваяАналитика_1				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяДоходов;
	Элемент.ЛеваяАналитика_2				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.НаправлениеДеятельности;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных 		   = "СтатьиРасходов_СтатьиОборотов";
	Элемент.Наименование 					   = НСтр("ru = 'Статьи расходов --> статьи оборотов'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код 							   = "СтатьиРасходов_СтатьиОборотов";
	// АПК:1297-вкл.
	Элемент.Соотношение 					   = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКОдному;
	Элемент.Приоритет 						   = 0;
	Элемент.ЛеваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяРасходов;
	Элемент.ЛеваяАналитика_2 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ПрочиеРасходы;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных 		   = "СтруктураПредприятия_ЦФО";
	Элемент.Наименование 					   = НСтр("ru = 'Структура предприятия --> ЦФО'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код 							   = "СтруктураПредприятия_ЦФО";
	// АПК:1297-вкл.
	Элемент.Соотношение 					   = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКОдному;
	Элемент.Приоритет 						   = 0;
	Элемент.ЛеваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтруктураПредприятия;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ЦФО;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных 		   = "ЦФО_Организации";
	Элемент.Наименование 					   = НСтр("ru = 'ЦФО --> Организации'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код 							   = "ЦФО_Организации";
	// АПК:1297-вкл.
	Элемент.Соотношение 					   = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКОдному;
	Элемент.Приоритет 						   = 0;
	Элемент.ЛеваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ЦФО;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.Организации;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных 		   = "СтатьиПрочихРасходовСтатьиОборотов";
	Элемент.Наименование 					   = НСтр("ru = 'Статьи прочих расходов --> Статьи оборотов'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код 							   = "СтатьиПрочихРасходов_СтатьиОборотов";
	// АПК:1297-вкл.
	Элемент.Соотношение 					   = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКОдному;
	Элемент.Приоритет 						   = 0;
	Элемент.ЛеваяАналитика_1				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ПрочиеДоходыИРасходы;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных 		   = "СтатьиОборотовБДР_СтатьиОборотовБДДС";
	Элемент.Наименование 					   = НСтр("ru = 'Статьи оборотов БДР --> Статьи оборотов БДДС'", ОбщегоНазначения.КодОсновногоЯзыка());
	// АПК:1297-выкл. Строковый параметр.
	Элемент.Код 							   = "СтатьиОборотовБДР_СтатьиОборотовБДДС";
	// АПК:1297-вкл.
	Элемент.Соотношение 					   = Перечисления.бит_ВидыСоотношенийАналитик.МногиеКОдному;
	Элемент.Приоритет 						   = 0;
	Элемент.ЛеваяАналитика_1				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов;
	Элемент.ПраваяАналитика_1 				   = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов;
	Элемент.ПрименятьПриПолномСовпаденииТипов  = Ложь;
	Элемент.АнализироватьКорреспондирующийСчет = Ложь;
	// -- ЕРП 
	
КонецПроцедуры

// См. бит_ОбновлениеИнформационнойБазыБФ.ПередОбновлениемИнформационнойБазы().
//
Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт
	
	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);
	
КонецПроцедуры

#КонецОбласти

// Функция возвращает максимальное количество аналитик, используемое в соответствии.
// 
// Возвращаемое значение:
//  Результат - Число.
// 
Функция МаксКоличествоАналитик() Экспорт

	Возврат 3;
	
КонецФункции // МаксКоличествоАналитик()

// Функция возвращает список имен, зарезервированных для фиксированных соответствий.
// 
// Возвращаемое значение:
//  Имена - Строка.
// 
Функция ЗарезервированныеИмена() Экспорт
	
	Имена = Новый СписокЗначений;
	
	флЕстьРегистр = ?(НЕ Метаданные.РегистрыСведений.Найти("бит_СтатьиОборотов_СтатьиРегл") = Неопределено, Истина, Ложь);
	
	Если флЕстьРегистр Тогда
		Имена.Добавить("Статьи_СтатьиРегл");
	КонецЕсли; 
	
	флЕстьРегистр = ?(НЕ Метаданные.РегистрыСведений.Найти("бит_СтатьиОборотов_НоменклатурныеГруппы") = Неопределено, Истина, Ложь);
	
	Если флЕстьРегистр Тогда
		Имена.Добавить("Статьи_НоменклатурныеГруппы");
	КонецЕсли; 
	
	флЕстьРегистр = ?(НЕ Метаданные.РегистрыСведений.Найти("бит_ЦФО_Подразделения") = Неопределено, Истина, Ложь);		
	
	Если флЕстьРегистр Тогда
		Имена.Добавить("ЦФО_Подразделения");
	КонецЕсли; 
	
	Возврат Имена;
	
КонецФункции // ЗарезервированныеИмена()

// Функция определяет наличие записей в РС.бит_СоответствиеАналитик.
// 
// Возвращаемое значение:
//  флЕстьЗаписи - Булево.
// 
Функция ЕстьЗаписи(ВидСоответствия) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидСоответствия", ВидСоответствия);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_СоответствияАналитик.ВидСоответствия
	|ИЗ
	|	РегистрСведений.бит_СоответствияАналитик КАК бит_СоответствияАналитик
	|ГДЕ
	|	бит_СоответствияАналитик.ВидСоответствия = &ВидСоответствия";
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
